In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),
                    index=pd.Index(['SF', 'LA'], name='city'),
                    columns=pd.Index(['A', 'B', 'C', 'D'], name='letter'))

In [3]:
dframe1

letter  A  B  C  D
city
SF      0  1  2  3
LA      4  5  6  7

In [5]:
dframe_st = dframe1.stack()

In [6]:
dframe_st

city  letter
SF    A         0
      B         1
      C         2
      D         3
LA    A         4
      B         5
      C         6
      D         7
dtype: int64

In [7]:
dframe_st.unstack()

letter  A  B  C  D
city
SF      0  1  2  3
LA      4  5  6  7

In [9]:
dframe_st.unstack('city')

city    SF  LA
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [10]:
dframe_st.unstack('letter')

letter  A  B  C  D
city
SF      0  1  2  3
LA      4  5  6  7

In [11]:
ser1 = Series([0, 1, 2], index=['Q', 'X', 'Y'])

ser2 = Series([3, 4, 5], index=['X', 'Y', 'Z'])

In [12]:
ser1

Q    0
X    1
Y    2
dtype: int64

In [13]:
ser2

X    3
Y    4
Z    5
dtype: int64

In [16]:
dframe = pd.concat([ser1, ser2], keys=['Alpha', 'Beta'])

In [17]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  3.0  4.0  5.0

In [18]:
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    3.0
       Y    4.0
       Z    5.0
dtype: float64

In [19]:
dframe = dframe.unstack()

In [20]:
dframe

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  3.0  4.0  5.0

In [21]:
dframe.unstack()

Q  Alpha    0.0
   Beta     NaN
X  Alpha    1.0
   Beta     3.0
Y  Alpha    2.0
   Beta     4.0
Z  Alpha    NaN
   Beta     5.0
dtype: float64

In [24]:
dframe.stack(dropna=False)

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    3.0
       Y    4.0
       Z    5.0
dtype: float64